{
  "title": {
    "name": "Jonathan McCaffrey",
    "title": "Software Developer"
  },
  "personalInfo": [
    {
      "name": "Address",
      "value": "2045 Carling"
    },
    {
      "name": "Phone",
      "value": "613-277-8353"
    },
    {
      "name": "Email",
      "value": "jonmcc.0723@gmail.com"
    },
    {
      "name": "WWW",
      "value": "https://jonathanmc.dev/"
    },
    {
      "name": "LinkedIn",
      "value": "https://www.linkedin.com/in/jonmcc/"
    },

    {
      "name": "GitHub",
      "value": "https://github.com/JonathanMcCaffrey"
    },
    {
      "name": "Facebook",
      "value": "https://www.facebook.com/jonathan.mccaffrey.50"
    },
    {
      "name": "Twitch",
      "value": "https://www.twitch.tv/jonathan_mcc"
    }
  ],
  "Skills": [
    "React",
    "HTML, CSS",
    "JS, TypeScript",
    "Agile, Scrum",
    "Jira",
    "Unit Tests",
    "Selenium",
    "Jenkins",
    "REST, APIs",
    "PC, Mac, Mobile",
    "Documentation",
    "Regex"
  ],

  "Summary": "In industry since 2012, while playing a pivotal role in all aspects of the software stack, from prototype to release, and improving applications with patches based on customer feedback and data in production.",
  "Experience": [
    {
      "date": "2015-2020",
      "location": "bitHeads, Tech shop with a focus on cloud-based technology",
      "role": "Full Stack Developer",
      "points": [
        "Worked on a portal and mobile faceing web app for a SaaS project written in React.js",
        "Maintained brainCloud’s unit tests, examples and libraries in Java, ObjC, C++, C#, and JS. Wrote scripts to generate API content to reduce hours spent documenting.",
        "Created brainCloud’s Command Line tool in Node.js and other test tools, for developers and QA to test and stress test API and server features.",
        "Wrote documentation, tutorials and offer guidance to bring new co-workers up to speed on the BaaS environment. Maintained support systems for customer success.",
        "Maintained and wrote Jenkins Pipeline in Groovy, for improved test reporting and team CI.",
        "Developed Test Automation for brainCloud and Nortec/Condair Help websites in Java, to reduce manual testing time spent on an agile team."
      ]
    },
    {
      "date": "2012-2015",
      "location": "Smoke Labs, Tech startup with a focus on mobile games",
      "role": "Mobile Game Developer",
      "points": [
        "Developed key systems in Blokus, Mattel branded title nominated in the Canadian Videogame Awards for 'Best Game Design' and 'Best Social or Casual Game.'",
        "Experience integrating a multitude of analytics, ad systems, and backends, including Google Analytics, Game Analytics, Flurry, Mopub, and Playhaven.",
        "Spent time working with external QA team to bridge company's knowledge gaps between developer and QA workflows."
      ]
    }
  ]
}
